In [1]:
import pandas as pd

In [86]:
def read_year(*years):
    filenames = []
    names = pd.DataFrame()
    result = pd.DataFrame()
    for k in years:
        filenames = ('names/yob'+ k + '.txt')
        names_t = pd.read_csv(filenames, names=['Name','Gender','Count'])
        names_t['Year'] = k
        names = pd.concat([names, names_t])
        result = names.groupby(['Name']).sum()
    return result

In [92]:
nam = read_year('1900','1950','2000')
pd.set_option('display.max_rows',10)

In [93]:
nam

          Count
Name
Aadam         6
Aadarsh       5
Aadil         9
Aaditya      11
Aahil         6
...         ...
Zyria        21
Zyron        12
Zyshaun       6
Zyshawn      10
Zyshonne     17

[31932 rows x 1 columns]

In [94]:
nam.sort_values('Count',ascending=False).head(3)

         Count
Name
James   111789
John    109601
Robert  101368

In [97]:
newnames = pd.read_csv('names/yob2017.txt',names=['Name','Gender','Count'])

In [101]:
print(newnames.groupby(['Gender']).sum())

          Count
Gender
F       1719138
M       1842837

In [102]:
newnames = pd.read_csv('names/yob2016.txt',names=['Name','Gender','Count'])
print(newnames.groupby(['Gender']).sum())

          Count
Gender
F       1766212
M       1891585

In [105]:
def count_dynamics(*years):
    filenames = []
    names = pd.DataFrame()
    result = pd.DataFrame()
    for k in years:
        filenames = ('names/yob'+ k + '.txt')
        names_t = pd.read_csv(filenames, names=['Name','Gender','Count'])
        names_t['Year'] = k
        names = pd.concat([names, names_t])
        result = names.groupby(['Gender','Year']).sum()
    return result

In [106]:
newres = count_dynamics('1900','1950','2000')

In [107]:
newres

               Count
Gender Year
F      1900   299798
       1950  1713065
       2000  1815295
M      1900   150480
       1950  1790437
       2000  1963202